# OSS_13
오픈소스 소프트웨어 기초 Github 협업과제 - 학교 도서관 이용 질서 개선 규칙

---

경북대학교 도서관 이용 질서 개선 규칙

•주요 조항 (핵심 규칙)

제1조 (자료 대출 및 반납)

① 자료 대출은 반드시 본인의 회원증(실물 학생증, 모바일 학생증, 교원증)을 제시해야 한다. 회원증은 타인에게 양도·대여할 수 없으며 부정 사용 적발 시 적발일로부터 30일간 대출 자격을 정지한다.

② 대출 권수 및 기간은 도서관의 별도 '자료 대출 규정'에 따르며, 반납 기일을 준수해야 한다.

③ 연체 시에는 연체일수만큼 대출이 정지될 수 있으며, 3회 이상 상습 연체 시 회원 자격이 일정 기간 정지될 수 있다.

④ 도서관이 지정한 일부 자료(참고도서, 정기간행물 최신호 등)는 관외 대출이 제한될 수 있다.


제2조 열람실 이용에 관한 조항

1. 신관 모든 열람실 좌석은 ‘KNU 도서관’ 애플리케이션에서 예약 후 이용해야 한다. 위반 적발 시 열람실 이용을 1일간 금지한다.

2. 열람실 좌석 이용 시간을 반드시 준수해야 하며, 이용 시간이 종료되면 좌석을 반납하거나 이용 시간 연장을 해야 한다. 이용 시간 종료까지 이용 시간 연장 또는 좌석 반납을 하지 않을 시 1일간 열람실 좌석 대여를 제한한다.

3. 열람실 환경 유지를 위해 도서관 학생위원회 인원들이 불시 순찰을 진행하며, 금지 행위 적발 시 학생회 인원의 제재를 받을 수 있다. 

4. 열람실 내에서 물, 음료 외 모든 음식물 섭취를 금지한다.

5. 열람실 내에서 1인 1좌석 이용을 원칙으로 한다.


제3조 (소음 관리 및 쾌적한 환경 유지)

① 모든 이용자는 도서관 내 정숙을 유지해야 하며, 학습 공간에서는 대화, 웃음소리, 기기 알림음, 코골이 등으로 타인의 학습을 방해해서는 안 된다.

② 휴대전화는 무음 또는 진동 모드로 설정하며, 통화는 반드시 도서관 외부 또는 지정된 통화 구역에서만 가능하다.

③ 전자기기 사용 시 이어폰 착용은 필수이며, 소리는 외부로 새어나오지 않도록 볼륨을 조절해야 한다. 노트북 키보드 소음 등도 최소화하도록 유의한다.

④ 강한 냄새가 나는 음식물, 향수, 방향제 등의 사용을 자제하여 쾌적한 실내 환경을 유지해야 한다.

⑤ 타인의 집중을 방해하는 모든 행위(자리 이동 시 소음, 의자 끌기, 과도한 물품 정리 등)는 정도에 따라 도서관 직원의 주의 또는 제재 대상이 될 수 있다.

제4조 시설물 예약 및 이용에 관한 수칙

① 모든 시설물은 반드시 'KNU 도서관' 애플리케이션에서 예약 후 이용해야 한다. 예약 시간 미준수 시, 시설물 이용을 5일간 금지한다.

② 모든 시설물은 이용 시작과 동시에 'KNU 도서관' 애플리케이션 내 '입장확인' 버튼을 눌러 다른 이용자에게 혼란을 주는 일을 절대적으로 방지해야 한다.

③ 모든 시설물은 반드시 정해진 수용 인원수를 지켜야 한다. 적발 시, 시설물 이용을 5일간 금지한다.

④ 모든 시설물은 반드시 정해진 시간을 지켜야 하며, 자리비움 또는 취침 등의 이유로 이용시간을 초과해 다음 예약자에게 불편을 주는 행동을 금지한다.

⑤ 시설물 내 물 및 음료수 섭취를 허용하되, 절대 흘리지 않아야 하며 다음 예약자를 위해 사용 후 뒷정리를 깔끔하게 해야 한다.

⑥ 대부분의 시설물은 2인 이상 이용이 가능한 곳이다. 따라서 조용한 도서관 환경을 위해 반드시 정숙해야 하며, 소음 발생에 더욱 신경써야 한다.

제 5조 질서 위반 시 제재 및 신고
